import random

'''
2020.12.25
1.数字a从0开始每次递增1，数字b从1开始每次递增2，数字C从2开始每次递增3，求：当三个数字递增到200时，a b c有几次相等。
'''






'''
2.有已知数组alist,数组blist，请输出两个数组中，不相同的数的值的和。
'''
alist = [15,20,17,19,135,443,500,900]
blist = [71,35,49,15,114,533,557,1546]





'''
3.已知数组tlist,将他从小到大排序，并输出排序后的结果。
'''
tlist = [45,1,58,59,77,12,46,76,95,111,777,55,43]




'''
4.有一盒打印纸，总数为500，第一天用了10张，之后每天都比前一天多用10张，求多久能用完所有的纸。
'''




'''
5.数组list1和list2为随机生成的数组，输出他们中间相同的数的和，如果没有相同的数则输出两个数组无相同数字。
'''
list1 = []
s = random.randint(1,20)
for i in range(0,s):
    list1.append(random.randint(0,100))
list2 = []
for i in range(0,s):
    list2.append(random.randrange(0,100))

